app/controllers/events_controller.rb

SELECT `events`.* FROM `events`
---
  def index
    @events = Event.all

INSERT INTO `events` (`title`, `name`, `number`, `created_at`, `updated_at`) VALUES ('1', '2', 3, '2017-06-06 08:01:03', '2017-06-06 08:01:03')
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save

DELETE FROM `events` WHERE `events`.`id` = 1
---
  def destroy
    @event.destroy

SELECT  `events`.* FROM `events` WHERE `events`.`id` = 4 LIMIT 1
---
    def set_event
      @event = Event.find(params[:id])